Revit 2027 API
Grid.Curve Property
Retrieves an object that represents the geometry of the grid line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve Curve { get; }
Public ReadOnly Property Curve As Curve
	Get
public:
property Curve^ Curve {
	Curve^ get ();
}
member Curve : Curve with get
Property Value
Curve
Remarks
The geometry can either be an arc or a curve. The IsCurved property can be used to determine this.
See Also
Reference
Grid Class
Autodesk.Revit.DB Namespace